Tekla.Structures.Drawing.AutoSizeOptions
Options for controlling how the sheet size is
calculated when the SizeDefinitionMode is AutoSize.
Deprecated since TS2020.
Tekla.Structures.Drawing.SizeDefinitionMode
Tekla.Structures.Drawing.LayoutAttributes

Tekla.Structures.Drawing.AutoSizeOptions.CalculatedSizes
Use "calculated size" values of the selected layout in the drawing.

Tekla.Structures.Drawing.AutoSizeOptions.FixedSizes
Use "fixed size" values of the selected layout in the drawing.

Tekla.Structures.Drawing.AutoSizeOptions.CalculatedAndFixedSizes
Use both "fixed size" and "calculated size"
values of the selected layout in the drawing.